In [3]:
import pandas as pd
df = pd.read_excel('menu-items-events-companies.xlsx', index_col=0)

In [4]:
df.head()

,event_id,menu_item_name,quantity,menu_item_id,unit_price,total_price,event_name,company_name,suite,customer_name,category_name
order_id,,,,,,,,,,,
1,61,ARANCINI BROTHERS RICE BALL SAMPLER,1,135,119.0,119.0,RANGERS VS COLUMBUS,Willow Lifestyle Clubs,MLS-715,Alexander Kharlamov,Appetizer
1,61,BRISKET SLIDERS,1,148,163.0,163.0,RANGERS VS COLUMBUS,Willow Lifestyle Clubs,MLS-715,Alexander Kharlamov,Sandwiches
2,1,GRILLED CHEESE SANDWICHES WITH TOMATO “SOUP” DIP,1,48,127.0,127.0,AMC PREMIERE - TWD,Willow Lifestyle Clubs,MLS-715,Richard Barrow,Sandwiches
2,1,CHEESE RAVIOLI,4,147,177.0,708.0,AMC PREMIERE - TWD,Willow Lifestyle Clubs,MLS-715,Richard Barrow,Entrée
3,2,GUINNESS (4 PACK),1,91,40.0,40.0,BILLY JOEL,Willow Lifestyle Clubs,MLS-715,Alexander Kharlamov,Beer

In [5]:
df.describe()

,event_id,quantity,menu_item_id,unit_price,total_price
count,387018.000000,387018.000000,387018.000000,387018.000000,387018.000000
mean,702.370357,1.086942,185.474161,100.378481,105.381521
std,337.755437,0.382249,158.648329,59.238552,64.161264
min,1.000000,0.000000,1.000000,0.000000,0.000000
25%,445.000000,1.000000,60.000000,53.000000,66.000000
50%,701.000000,1.000000,139.000000,96.000000,101.000000
75%,987.000000,1.000000,268.000000,133.000000,134.000000
max,1320.000000,16.000000,631.000000,2200.000000,4400.000000

In [6]:
df.shape

(387018, 11)

In [7]:
df.dtypes

event_id            int64
menu_item_name     object
quantity            int64
menu_item_id        int64
unit_price        float64
total_price       float64
event_name         object
company_name       object
suite              object
customer_name      object
category_name      object
dtype: object

In [8]:
df.isnull().sum()

event_id          0
menu_item_name    0
quantity          0
menu_item_id      0
unit_price        0
total_price       0
event_name        0
company_name      0
suite             0
customer_name     0
category_name     0
dtype: int64

In [10]:
df.isin([0]).sum()

event_id           0
menu_item_name     0
quantity           8
menu_item_id       0
unit_price        25
total_price       25
event_name         0
company_name       0
suite              0
customer_name      0
category_name      0
dtype: int64